using System;
using System.Collections.Generic;
using System.Text;

namespace Qc.WestcnSdk.Models.Domain
{
    public enum GeneralErrorType
    {
        认证失败 = 10000,
        token_时间超时 = 10001,
        ip_授权失败 = 10002,
        价格设置有误 = 10003,
        参数有误 = 20000,
        无权操作或数据不存在 = 20001,
        域名格式有误 = 20102,
        禁止注册 = 20103,
        域名密码长度必须大于8位 = 20104,
        dns有误 = 20105,
        临时模板禁止操作 = 20106,
        修改DNS相同 = 20107,
        域名转移中不允许操作 = 20108,
        未注册DNS或不支持此类后缀的解析 = 20109,
        您域名所有者ID被CNNIC列入了黑名单 = 20110,
        域名状态不正确 = 20111,
        DNS非我司不允许操作 = 20112,
        解析类型值有误 = 20113,
        禁止解析操作 = 20114,
        解析记录数超限制 = 20115,
        未添加默认线路 = 20116,
        记录已经存在重复添加 = 20118,
        TTL值有误限制60_86400 = 20119,
        解析记录ID有误 = 20120,
        域名到期时间有误请联系管理员 = 20121,
        系统参数错误 = 30000,
        账号余额不足 = 30100,
        查询数据结果为空 = 30201,
        当前域名后缀接口维护 = 30202,
        创建相关联系人失败 = 30203,
        DNS未授权 = 30204,
        已注册域名 = 30205,
        证件类型与证件号不匹配 = 30206,
        域名包括禁用词 = 30207,
        域名为保留或溢价域名 = 30208,
        年限只能为1_2_3_5年_不能为4年 = 30209,
        域名联系人地址长度超过64字符 = 30210,
        所有者ID在黑名单, 请重新创建模板 = 30211,
        抱歉_续费失败_请联系管理员进行转入续费 = 30212,
        HK域名注册后24小时内不能续费 = 30213,
        域名已经进入赎回期, 不能续费 = 30214,
        域名年限有误 = 30215,
        接口异常 = 30216
    }
}
